public/2018/11/13/hacking-custom-variables-for-additional-augments-in-cfengine/index.html
<!DOCTYPE html>
<html>

    <head>
        <title> Hacking custom variables for additional augments in CFEngine &middot;  </title>

        <meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="generator" content="Hugo 0.123.7">






<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-+0n0xVW2eSR5OomGNYDnhzAbDsOXxcvSN1TPprVMTNDbiYZCxYbOOl7+AMvyTG2x" crossorigin="anonymous">


<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.7.2/css/all.css" integrity="sha384-fnmOCqbTlWIlj8LyTjo7mOUStjsKC4pOpQbqyi7RrhN7udi9RwhKkMHpvLbHG9Sr" crossorigin="anonymous">


<link rel="stylesheet" href="https://cmdln.org/css/nix.css">





<link href="https://fonts.googleapis.com/css?family=Inconsolata%7COpen+Sans%7CConcert+One" rel="stylesheet">






    </head>

    <body>
        <header>
	<nav class="navbar navbar-dark bg-dark fixed-top navbar-expand-lg font-header">
		<div class="container-fluid">
			<a class="navbar-brand" id="green-terminal" href='https://cmdln.org/'>
				nick@cmdln.org ~ $
			</a>
			<button type="button" class="navbar-toggler" data-bs-toggle="collapse" data-bs-target="#navbar-collapse-1" 
					aria-controls="navbar-collapse-1" aria-expanded="false">
				<span class="visually-hidden">Toggle navigation</span>
				<span class="navbar-toggler-icon"></span>
			</button>
	
			
			<div class="collapse navbar-collapse" id="navbar-collapse-1">
				<ul class="nav navbar-nav ms-auto">
					<li class="nav-item">
						<a class="nav-link" href='https://cmdln.org/'>
							/home/nick</a>
					</li>
					
					
					
					<li class="nav-item dropdown">
						
						<a class="nav-link" href="https://cmdln.org/post/">~/posts</a>
						
					</li>
					
				</ul>
			</div>
		</div>
	</nav>
</header>

        <div class="flex-wrapper">
            <div class="container wrapper">
                <h1><a href="https://cmdln.org/2018/11/13/hacking-custom-variables-for-additional-augments-in-cfengine/">Hacking custom variables for additional augments in CFEngine</a></h1>
                <span class="post-date">2018-11-13 </span>
                <div class="post-content">
                    
<p>
CFEngine 3.12.0 introduced the <a href="https://docs.cfengine.com/docs/3.12/reference-language-concepts-augments.html#augments"><em>augments</em> key</a> to the <a href="https://docs.cfengine.com/docs/3.12/reference-language-concepts-augments.html#augments">Augments file format</a>. If
you are not already familiar with Augments, check it out. It&#39;s a very easy way
to define classes and variables very early during agent execution, before
policy.</p>
<p>
The new augments key allows you to merge additional data in the augments format
on top of the base augments. I However, there is, I think, still a simple way to
accomplish this. This can provide a flexible way of providing different data to
different sets of machines.</p>
<p>
Since augments are loaded very early during policy evaluation. Currently, only
<a href="https://docs.cfengine.com/docs/3.12/reference-special-variables.html">special variables</a> like the <a href="https://docs.cfengine.com/docs/3.12/reference-special-variables-sys.html"><code class="verbatim">sys</code> vars</a> can be used to select additional augments.
The question arises …</p>
<blockquote>
<p>How can I extend augments from custom policy?</p>
</blockquote>
<p>
The short answer is that you can&#39;t, at least not directly, but there are a
couple of things that you can do to achieve the same result.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Customize /etc/os-release
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
In 3.11.0 CFEngine began parsing <code class="verbatim">/etc/os-release</code> during system discovery into
<a href="https://docs.cfengine.com/docs/master/reference-special-variables-sys.html#sys-os_release">sys.os_release</a>. I think that <code class="verbatim">/etc/os-release</code> is perhaps a good place for you
to encode this <code class="verbatim">DEVICE_TYPE</code>. It&#39;s a simple <code class="verbatim">key=value</code> format, and according to
the docs on freedesktop.org <a href="https://www.freedesktop.org/software/systemd/man/os-release.html">the file format may be extended by vendors</a>. It&#39;s
highly recommended to prefix new fields with an OS specific name in order to
avoid name clashes.</p>
<p>
So, let&#39;s edit <code class="verbatim">/etc/os-release</code> and define <code class="verbatim">CUSTOM_DEVICE_TYPE</code>. This is
<code class="verbatim">/etc/os-release</code> on my workstation, after I have edited it to add my new key
value.</p>
<pre class="example">
  NAME=&#34;Ubuntu&#34;
  VERSION=&#34;18.10 (Cosmic Cuttlefish)&#34;
  ID=ubuntu
  ID_LIKE=debian
  PRETTY_NAME=&#34;Ubuntu 18.10&#34;
  VERSION_ID=&#34;18.10&#34;
  HOME_URL=&#34;https://www.ubuntu.com/&#34;
  SUPPORT_URL=&#34;https://help.ubuntu.com/&#34;
  BUG_REPORT_URL=&#34;https://bugs.launchpad.net/ubuntu/&#34;
  PRIVACY_POLICY_URL=&#34;https://www.ubuntu.com/legal/terms-and-policies/privacy-policy&#34;
  VERSION_CODENAME=cosmic
  UBUNTU_CODENAME=cosmic
  CUSTOM_DEVICE_TYPE=laptop
</pre>
<p>
This way, when the agent initializes, it will have
<code class="verbatim">sys.os_release[CUSTOM_DEVICE_TYPE]</code> available for use. This could be set during
initial provisioning, or of course cfengine policy could manage the extra file
content.</p>
<p>
Here is a small example:</p>
<p>
<strong>def.json:</strong></p>
<div class="src src-json">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-json" data-lang="json"><span class="line"><span class="cl"><span class="p">{</span>
</span></span><span class="line"><span class="cl">  <span class="nt">&#34;vars&#34;</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="nt">&#34;my_var&#34;</span><span class="p">:</span> <span class="s2">&#34;I am RED&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">},</span>
</span></span><span class="line"><span class="cl">  <span class="nt">&#34;augments&#34;</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span>
</span></span><span class="line"><span class="cl">    <span class="s2">&#34;$(sys.os_release[CUSTOM_DEVICE_TYPE]).json&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">]</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div>
</div>
<p>
Here is my data file that is used when <code class="verbatim">CUSTOM_DEVICE_TYPE</code> is set to <code class="verbatim">laptop</code>.</p>
<p>
<strong>laptop.json:</strong></p>
<div class="src src-json">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span><span class="lnt">2
</span><span class="lnt">3
</span><span class="lnt">4
</span><span class="lnt">5
</span><span class="lnt">6
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-json" data-lang="json"><span class="line"><span class="cl"><span class="p">{</span>
</span></span><span class="line"><span class="cl">  <span class="nt">&#34;vars&#34;</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="nt">&#34;my_var&#34;</span><span class="p">:</span> <span class="s2">&#34;I am BLUE&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">}</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div>
</div>
<p>
Here is the simple policy to illustrate the point.</p>
<p>
<strong>promises.cf:</strong></p>
<div class="src src-cfengine3">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span><span class="lnt">2
</span><span class="lnt">3
</span><span class="lnt">4
</span><span class="lnt">5
</span><span class="lnt">6
</span><span class="lnt">7
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-cfengine3" data-lang="cfengine3"><span class="line"><span class="cl">  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">main</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="kd">reports</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">      <span class="s">&#34;def.my_var is </span><span class="si">$(def.my_var)</span><span class="s">&#34;</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">      <span class="s">&#34;My device type is </span><span class="si">$(sys.os_release[CUSTOM_DEVICE_TYPE])</span><span class="s">&#34;</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">  <span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div>
</div>
<p>
<strong>Output:</strong></p>
<pre class="example">
&gt; $ cf-agent -KIf ./promises.cf                                                                                 
R: def.my_var is I am BLUE
R: My device type is laptop
</pre>
<p>
In the above output, note that <code class="verbatim">def.my_var</code> is <code class="verbatim">BLUE</code>, what happens if you
change the <code class="verbatim">CUSTOM_DEVICE_TYPE</code>?</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Download device type specific data to a stable location
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
An alternate methodology to achieve similar results would be to reference a
stable location, but use a files promise to ensure that the proper device type
specific data is there.</p>
<p>
For example, instead of shipping <code class="verbatim">device_type1.json</code> and <code class="verbatim">devices_type2.json</code> as
part of the policy, you can download it to <code class="verbatim">device.json</code>.</p>
<p>
This copy_from files promise illustrates what I mean:</p>
<div class="src src-cfengine3">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span><span class="lnt">2
</span><span class="lnt">3
</span><span class="lnt">4
</span><span class="lnt">5
</span><span class="lnt">6
</span><span class="lnt">7
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-cfengine3" data-lang="cfengine3"><span class="line"><span class="cl">  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">device_type_data</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span>
</span></span><span class="line"><span class="cl">      <span class="kd">files</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="s">&#34;/var/cfengine/inputs/device.json&#34;</span>
</span></span><span class="line"><span class="cl">          <span class="kr">copy_from</span> <span class="o">=&gt;</span> <span class="nf">remote_dcp</span><span class="p">(</span> <span class="s">&#34;/var/cfengine/data/devices/</span><span class="si">$(my_common.device_type)</span><span class="s">.json&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">                                   <span class="nv">$(sys.policy_hub)</span> <span class="p">);</span>
</span></span><span class="line"><span class="cl">  <span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div>
</div>
<p>
Then the base augments would look like this:</p>
<p>
<strong>def.json:</strong></p>
<div class="src src-json">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-json" data-lang="json"><span class="line"><span class="cl"><span class="p">{</span>
</span></span><span class="line"><span class="cl">  <span class="nt">&#34;vars&#34;</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="nt">&#34;my_var&#34;</span><span class="p">:</span> <span class="s2">&#34;I am RED&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">},</span>
</span></span><span class="line"><span class="cl">  <span class="nt">&#34;augments&#34;</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span>
</span></span><span class="line"><span class="cl">    <span class="s2">&#34;device.json&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">]</span>
</span></span><span class="line"><span class="cl"><span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div>
</div>
</div>
</div>

                </div>
                
                <div class="post-comments">
                    
                </div>
                
            </div>
            <footer class="footer text-center">
<p>Copyright &copy; 2025 Nick Anderson -
<span class="credit">
	Powered by
	<a target="_blank" href="https://gohugo.io">Hugo</a>
	and
	<a target="_blank" href="https://github.com/LordMathis/hugo-theme-nix/">Nix</a> theme.
</span>
</p>
</footer>

        </div>
    </body>
